MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32TG11B320F128GM64/mcu.h
#define CRYPTO_PRESENT          /**< CRYPTO is available in this part */
#define CRYPTO_COUNT          1 /**< 1 CRYPTOs available  */
#define CAN_PRESENT             /**< CAN is available in this part */
#define CAN_COUNT             1 /**< 1 CANs available  */
#define TIMER_PRESENT           /**< TIMER is available in this part */
#define TIMER_COUNT           2 /**< 2 TIMERs available  */
#define WTIMER_PRESENT          /**< WTIMER is available in this part */
#define WTIMER_COUNT          2 /**< 2 WTIMERs available  */
#define USART_PRESENT           /**< USART is available in this part */
#define USART_COUNT           4 /**< 4 USARTs available  */
#define UART_PRESENT            /**< UART is available in this part */
#define UART_COUNT            1 /**< 1 UARTs available  */
#define LEUART_PRESENT          /**< LEUART is available in this part */
#define LEUART_COUNT          1 /**< 1 LEUARTs available  */
#define LETIMER_PRESENT         /**< LETIMER is available in this part */
#define LETIMER_COUNT         1 /**< 1 LETIMERs available  */
#define PCNT_PRESENT            /**< PCNT is available in this part */
#define PCNT_COUNT            1 /**< 1 PCNTs available  */
#define I2C_PRESENT             /**< I2C is available in this part */
#define I2C_COUNT             2 /**< 2 I2Cs available  */
#define ADC_PRESENT             /**< ADC is available in this part */
#define ADC_COUNT             1 /**< 1 ADCs available  */
#define ACMP_PRESENT            /**< ACMP is available in this part */
#define ACMP_COUNT            2 /**< 2 ACMPs available  */
#define VDAC_PRESENT            /**< VDAC is available in this part */
#define VDAC_COUNT            1 /**< 1 VDACs available  */
#define WDOG_PRESENT            /**< WDOG is available in this part */
#define WDOG_COUNT            1 /**< 1 WDOGs available  */
#define TRNG_PRESENT            /**< TRNG is available in this part */
#define TRNG_COUNT            1 /**< 1 TRNGs available  */
#define MSC_PRESENT             /**< MSC is available in this part */
#define MSC_COUNT             1 /**< 1 MSC available */
#define EMU_PRESENT             /**< EMU is available in this part */
#define EMU_COUNT             1 /**< 1 EMU available */
#define RMU_PRESENT             /**< RMU is available in this part */
#define RMU_COUNT             1 /**< 1 RMU available */
#define CMU_PRESENT             /**< CMU is available in this part */
#define CMU_COUNT             1 /**< 1 CMU available */
#define LESENSE_PRESENT         /**< LESENSE is available in this part */
#define LESENSE_COUNT         1 /**< 1 LESENSE available */
#define GPIO_PRESENT            /**< GPIO is available in this part */
#define GPIO_COUNT            1 /**< 1 GPIO available */
#define PRS_PRESENT             /**< PRS is available in this part */
#define PRS_COUNT             1 /**< 1 PRS available */
#define LDMA_PRESENT            /**< LDMA is available in this part */
#define LDMA_COUNT            1 /**< 1 LDMA available */
#define GPCRC_PRESENT           /**< GPCRC is available in this part */
#define GPCRC_COUNT           1 /**< 1 GPCRC available */
#define CRYOTIMER_PRESENT       /**< CRYOTIMER is available in this part */
#define CRYOTIMER_COUNT       1 /**< 1 CRYOTIMER available */
#define BU_PRESENT              /**< BU is available in this part */
#define BU_COUNT              1 /**< 1 BU available */
#define CSEN_PRESENT            /**< CSEN is available in this part */
#define CSEN_COUNT            1 /**< 1 CSEN available */
#define LCD_PRESENT             /**< LCD is available in this part */
#define LCD_COUNT             1 /**< 1 LCD available */
#define RTCC_PRESENT            /**< RTCC is available in this part */
#define RTCC_COUNT            1 /**< 1 RTCC available */
#define BOOTLOADER_PRESENT      /**< BOOTLOADER is available in this part */
#define BOOTLOADER_COUNT      1 /**< 1 BOOTLOADER available */
#define SMU_PRESENT             /**< SMU is available in this part */
#define SMU_COUNT             1 /**< 1 SMU available */
#define MTB_PRESENT             /**< MTB is available in this part */
#define MTB_COUNT             1 /**< 1 MTB available */

/** @} End of group EFM32TG11B320F128GM64_Part */

#define ARM_MATH_CM0PLUS
// #include "core_cm0plus.h"      /* Cortex-M0+ processor and core peripherals */  // Note: Changed for MikroE implementation.
// #include "system_efm32tg11b.h" /* System Header File */  // Note: Changed for MikroE implementation.
#include <stdint.h>
#define     __I     volatile const       /*!< Defines 'read only' permissions */
#define     __O     volatile             /*!< Defines 'write only' permissions */
#define     __IO    volatile             /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} PRS_CH_TypeDef;

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} DMA_CH_TypeDef;

typedef struct {
  __IOM uint32_t CFG;                                /**< Configuration                                      */
  __IOM uint32_t LOOP;                               /**< Loop Counter                                       */
  __IOM uint32_t CTRL;                               /**< Control                                            */
  __IOM uint32_t SRC;                                /**< Source Address                                     */
  __IOM uint32_t DST;                                /**< Destination Address                                */
  __IOM uint32_t LINK;                               /**< Link Address                                       */
  __IOM uint32_t XCTRL;                              /**< Extended Control                                   */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t ILSRC;                              /**< Interleaving Source Address                        */
  uint32_t       RESERVED1[3U];                      /**< Reserved for future use                            */
} LDMA_CH_TypeDef;

/***************************************************************************//**
 * @defgroup EFM32TG11B320F128GM64_Peripheral_TypeDefs Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 ******************************************************************************/

// #include "efm32tg11b_msc.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_emu.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_rmu.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_cmu.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_crypto.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_lesense_st.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_lesense_buf.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_lesense_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_lesense.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_gpio_p.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_gpio.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_prs_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_prs.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_ldma_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_ldma.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_gpcrc.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_can_mir.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_can.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_timer_cc.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_timer.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_usart.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_leuart.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_letimer.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_cryotimer.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_i2c.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_adc.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_acmp.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_vdac_opa.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_vdac.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_csen.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_lcd.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_rtcc_cc.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_rtcc_ret.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_rtcc.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_wdog_pch.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_wdog.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_smu.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_trng.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_mtb.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_devinfo.h"  // Note: Changed for MikroE implementation.
// #include "efm32tg11b_romtable.h"  // Note: Changed for MikroE implementation.

